{"reviewer":{"0":"Diana Sharpe","1":"Doc","2":"River Temarc","3":"Catalyst","4":"R. Boulden","5":"Amazon Customer","6":"Joan Rogers","7":"Guillermo M.","8":"K. Porter","9":"R. L. Williams","10":"Yankee Sierra","11":"carlos Montoya","12":"K. Davis","13":"Scrooged!","14":"Whiskeybar","15":"jordan west","16":"Christine","17":"Alan Felt","18":"Kirk","19":"customer","20":"Abbie","21":"Max bar","22":"John","23":"Gemma Jackson","24":"BILL S.","25":"YL","26":"rumaldo","27":"Jorge","28":"H. R. Hopp","29":"brazos49"},"content":{"0":"I have used a cork-backed 6\" ruler for a while and find it quite handy. I wanted to get one for each of my family members but one wanted his ruler to start measuring from the end, and mine did not. I found these that do start right at the end. No cork back but instead conversions! They also have many different increments for both imperial and metric measurements.The best thing is the price. Four is a terrific value and everyone was happy to have their own small ruler. I will be ordering more so I have a few extra.","1":"Great little metal ruler to keep in your pocket on your apron.","2":"Metal, flexible, cork background to prevent slippage, and dual metric\/imperial calibration. Easy to read. Exactly what I was looking for.","3":"I drive an older semi truck and bought these for my paper log books. They are thicker than I expected, so they are stronger than expected and my pen doesn't \"jump\" off when filling out my log. Works great!!!!","4":"The markings on a lot of these small rules don’t align with the end. Yes, you shouldn’t use the end of any measuring for precise measurements.But having the markings align with the end of these rules is very convenient. I keep one in the apron I wear when I’m in the shop.Actually I kept 2 and gave 2 to my friends who do woodworking or machine shop work.","5":"Very nice rulers. Use them to cut fabric with a straight line and does not move around. Works great with paper too. Because of the cork on the other side they do not slide around.","6":"These are great for popping into a crafting or knitting bag so that you can check measurements on the go.","7":"I love this type of rulers for everyday work. Very handy when mesuaring hardware and small details. They are on the slim side, so the text on the back is somewhat small. They have sharp edges, so be carefull when you put them in your pocket!Awesome price for the pack.","8":"I needed a ruler to live in my pencil bag. This for the bill nicely!","9":"I bought these to use for quick relative measurements and as a small straight edge. They're great for both.","10":"This ruler is advertised as 0.9mm thick, but mine measured around 0.7mm. Not a big deal, especially considering the price, but if you're looking for a sturdy ruler, look for something better.","11":"Excelente producto, buen material, muy útil, tamaño perfecto","12":"These little six inchers are the perfect size to slip into the pocket on a Moleskine notebook.  (One reviewer mentioned a cork backing, which mine do not have.) Of course I typically use it to write in the journal, but you’d be surprised at how often I have found this to be useful in my day-to-day life because it is always with me and handy.","13":"Easy to use and easy to store.","14":"I use these at work. (I’m a printer.) They are easy to read. Once in awhile the one I’m using “disappears,” so I was glad to purchase 4 at such a good price.","15":"Thicker than standard size","16":"Perfect for fitting in a pencil\/pen bag and very sturdy.","17":"I like that there are 4 of them and that they are small enough to fit in a pen case. The corners are a bit sharp but not unreasonably so and it could be nice to have the sharp edge for accuracy.","18":"I can now know the dimensions of everything under one foot… and I can draw a great straight line!","19":"I thought all the reviews saying the edges and corners being sharp were just overly cautious. They're not. These rulers are rediculouslly sharp. If I were to slide the ruler across a page in a book I would be worried about scratching or tearing the paper. Not to mention my own skin. I really wanted to like these little rulers, but there was no way I could use them.","20":"Clear to read and came to me not bent worked for what I needed","21":"meh","22":"Accurate increments that begin at the edge of the scale. 10\/10 would recommend.","23":"Specifically bought this because the description said it would not bend. Well, it bends. It is very thin and cheap feeling, and it is way too flexible and bendy for my needs. if you need something stiff and rigid (lol), don’t buy this.","24":"value","25":"Not good quality. Flexible and lightweight","26":"Tailored","27":"I oder the product for my my kids 👎","28":"They're plastic rulers, what can I say?  They seem thick enough so they won't break easy, they have curved edges so you don't have to worry about poking anything and they are accurate.  For the money they are a great deal.","29":"These are completely adequate clear hard plastic rulers.  I'm not sure that the raised finger grip design adds enough utility to justify the space it takes up in storing the rulers.  I think a better offering here would be to include one of the raised grip model and have the others be the traditional flat design.  But I guess if you have a real preference for these grips, maybe you want all three to be that style.  The rulers are easy enough to read and provide metric and inches scales.  There's a hole near one end that could be used to hang the ruler from something, I suppose.  In terms of changes I'd have made, I would also have preferred for the ends of the rulers to be straight instead of the slight curve that they are.  In any event, these are useful low cost rulers.  I just don't quite understand or embrace the design."}}