{"reviewer":{"0":"K. MURPHY","1":"Try it or DIY it","2":"Impetigo","3":"Paul K.","4":"Adi","5":"JJ","6":"JJ","7":"Marnelli V.","8":"M. Barbetta","9":"KB","10":"bbass","11":"Jazmyn","12":"Big Steve from Seymour (by Gawd) Texas","13":"Torchwood","14":"Cyrine","15":"Amazon Customer","16":"Glenn","17":"madebyche","18":"Paul Smith","19":"Behrens","20":"St8kout","21":"The Happy Lad","22":"sbellamy3","23":"Nicole Marie","24":"Darrell R.","25":"jdlu","26":"Yiu Wong","27":"Mark Baker","28":"Skubuluchi","29":"Carter E Robertson"},"content":{"0":"UPDATE 12-15-2020 - After three weeks, I'm still really impressed with the M1 MacBook Air\/8 Core CPU\/8 Core GPU\/512 SSD\/8GB RAM. --- My updated plea: MAKE SURE YOU GET AS MUCH MEMORY & STORAGE AS YOU CAN AFFORD. SPECIAL ORDER ONE TO YOUR PROJECTED FUTURE NEED!Remember, Macs live a very long time and the value it holds will depend on how usable it will be to you or someone else in 5 or even 10 years. Not that long ago, 80 GB hard drives were HUGE... and UPGRADABLE. RAM was upgradable. The SSD and the RAM in these machines is NOT upgradable.The one issue for me has been that I am a memory hog! I tend to have LOTS of tabs open at once (I've caught myself with 50 (Safari) open in one browser and 39 (Chrome) in another!), while running Affinity\/Final Cut Pro - and YES, the dreaded Beach Ball has reared it's ugly head. Well, this got me to assess what I will be using the machine for and for how long.Storage can be added with external drives, slower, but it will let you scrape by. RAM is another story. When you constantly use up RAM, the system starts using \"swap memory\" where it uses the SSD to store temporary files. One of the YouTube reviewers (Created Labs) explains it like this: RAM memory is like writing on a white board, it's made to be temporary. Writing to the SSD is like writing on paper with a pencil. It can be erased, but if it's written on and erased for too long, it's going to degrade the medium. It will take years for this to cause problems, but keep in mind that in these M1 MacBooks, none of the parts are replaceable. The SSD and the RAM are soldered onto the board.***As ridiculously expensive as Apple RAM is, when it's not upgradable, get the maximum, in this case, 16 GB.I really doubt that Apple will be making machines with user upgradable RAM after the switch from Intel is complete, except for possibly the very high end Pro models.There is also the fact that if I am going to be doing a decent amount of video editing, a M1 with a fan will be helpful. Upgrading to the cheaper ($699+Upgrades) M1 Mac mini would be the cheapest way to get better performance for the Pro Apps, but I need a laptop, so... So, that is why I'm planning to return this machine and get one (likely the MacBook Pro M1), with 16 GB RAM & 1 TB SSD.***A note on browsers, Safari is by far the BEST browser to run on the M1, at least for now. I always had issues with saving web pages as PDF files in Chrome, where it did not save most of the images\/text on the page. In Safari, it's worked perfectly.------I purchased the MacBook Air M1, 8 core GPU, and 8 core CPU model, with 512 GB SSD and 8 GB RAM in person at the Apple Store (11-20-2020), with education pricing. I traded in my (MNYH2LL\/A) - 2017 12\" Macbook with the Intel M3 processor, 256 GB SSD, 8 GB Ram. I kept my charging adapter & C-cable (which are both compatible with the M1 Late 2020 Macbook Air), so ended up with a $330 Apple Store instant credit towards the M1.The M1 model has blown me away with its speed and smooth running with a large number of apps open, including Final Cut & Logic Pro. Admittedly the 2017 MB was the bottom of the line and I suffered under frequent overheating issues with too many things open and the single C-port fiasco.I likely would have gone with the 7 core GPU model if one had been in stock at the time of purchase, but I wanted 512 GB of SSD space, so I paid more by going with eh 8 core. From everything that I've seen, the lack of more RAM upgrades is not nearly as important as it was with the Intel x86 processors and is really only useful when you have many GPU intensive \"Pro Apps\" running at the same time.I would never have dreamed of running Final Cut or Logic Pro on the 2017 Macbook, so this has been an amazing upgrade for me.I would say that the bottom line is that if you're someone who only uses a laptop for office & basic web surfing and only has a few tabs open at once, and you never experience overheating or the dreaded beach ball \"not responding\" issues, or if you have non-Apple programs that have not been compiled for the M1 chip, hold off on the upgrade until more apps run natively on the M1. If however, you really need a machine that is MUCH more capable, faster and cooler running than the Intel models, it's a solid buy and an amazing upgrade from any non-upgradable Mac.","1":"Beautiful laptop. I’ve upgraded from the MacBook Air of old...so far this laptop has blown it away. It wasn’t overly pricey to be honest and I feel it’s worth the price. Overall look is great and keyboard feel is nice. Larger touchpad is great, I’ve paired my Magic Trackpad 2 with it as well.","2":"I have two MacBook Airs (MBA), a 13\" and a 11, both with the previous form factor (the wide, body colored bezel around the screen, 1280x800 resolution) and this new 13\" MBA improves upon it in every way (almost) and makes it nearly perfect.Good:- SCREEN looks great!  2560x1600 resolution is bright and sharp and looks good with the thin black bezel.  I usually don't go above 50% brightness.- KEYBOARD is good.  Some have mentioned that it still sucks, but I find it much better than the older MBAs that I own and better than say, the Magic Keyboard.  Even with a thin silicone keyboard cover I find the typing experience to be much better and I can type faster and with fewer mistakes.- BATTERY LIFE is fantastic.  Haven't done any real testing yet and obviously it depends on a lot of factors (wifi usage, video streaming, HD vs 4k video viewing\/processing\/etc., screen brightness, type of app being used, etc.) but for my usage (mostly web browsing, video viewing on YouTube, accessing VPN for work (Citrix, EPIC), etc., it has been great.  Easily tops 10 hours and super impressed so far.- LOOKS GREAT.  Love the newer (I know that the actual exterior design is a few years old by now) design, looks and feels great.  Form factor is nice and it is a reasonable weight.- NO FAN.  That's awesome, as it not only stays quiet all the time but you also do not need to worry about blocking any fan vents on the bottom or back of the case while you have it on your lap.  Pretty amazing really for a laptop to have no fans.- PERFORMANCE.  It works great so far on what I have used it for, which is not terribly a lot, but it is what it is for a laptop using Apple silicon for the first time.  For just day to day use and things like Chrome, Office (Word, Excel), Citirx, EPIC, etc., it has been super smooth and fast.  Have not tried gaming yet but do not have high hopes given it is the base model with 7-core GPU.  Also, things like start up are noticeably faster with the M1 versus my 2020 iMac 27\" (top end) with Intel chips.- TOUCH ID is great still.  Works very fast and the button does not get greasy (which makes it not work well) like the old iPhone home buttons.  On the other hand, it should really have Face ID at this point.- APPLE ECOSYSTEM is great as usual and a real reason to get this MBA.  Apple Watch easily unlocks it (so you do not really need Face ID if you have the watch).  You can easily send\/receive files using AirDrop or cast using AirPlay.  And so on and so forth.- BIG SUR comes preinstalled but you need to update to get 11.0.1.NOT GOOD:- WEBCAM still sucks.  Still low resolution and just does not look good in FaceTime, Teams, etc.  Shame that Apple is so slow to upgrade webcams on the Macs (the 27\" iMac FINALLY upgraded to 1080p front cams only a couple months ago... I got one and it looks so much better than this MBA's camera).- ONLY 2 PORTS.  Sad that this thing has only 2 USB-C ports (that cover thunderbolt 3, USB 3.1, charging, DisplayPort).  Given that it is used to charge, it leaves only one USB-C port for other use, pretty lame.  I wish they had squeezed (I think it would fit) a USB-A port so that I could plug in my wireless mouse USB-A dongle as I have never liked any bluetooth mouse, or at least one more USB-C port.- NEW TECH (Apple silicon) means the M1-optimized apps are still being rolled out, e.g. Photoshop still not available at release.- BATTERY still cannot be removed, no surprise here, but means that like all Apple mobile tech it will have a useable lifespan determined at least partly by the non-removable battery.  Easier to have an iPhone's battery replaced than a MBA I would imagine but hopefully it maintains a high level of performance for 4 years at the minimum.OVERALL:A few negatives (mostly the webcam) but enough significant improvements that this MBA is really a no-brainer for anyone needing a non-power notebook compute, especially if s\/he is already in the Apple ecosystem.  Love it so far!","3":"Liked:- Long battery life (one charge WILL last all day, i.e. 16 hours. Personally tested true)- Speed (the new M1 processor really is fast)- Quiet (no fan but the laptop still does not get hot)- Light and portable- High resolution & bright displayDisliked:- As with other MacBooks, the keyboard is mediocre especially compared to laptops like Lenovo Thinkpad- Incompatible applications (With the M1 processor still being new, you might experience existing programs frequently crash. For example, Chrome keeps crashing) But I would guess there will be a fix soon","4":"I'm a fan of apple products and I like almost everything about this new MBA. But it has one huge flaw that nobody talks about. It's the camera hardware and it hasn't been updated in ages. My zoom calls are so grainy and bad even with decent light. A $1000 laptop with 10 year old front camera is unacceptable. Camera is very important to me. Especially now that we all are quarantined at home and making zoom calls all the time.","5":"No complains so far.  Very fast and performs great.  I had a 2014 MacBook Air and finally upgraded this year.  This is leagues beyond that entry and I’m very happy with this upgrade.","6":"The M1 chip really is amazing. But it only lasted five days for me. Somehow mine managed to break after using a third party USB C hub. The screen wouldn’t turn on at all, and an Apple repair tech couldn’t figure it out after doing a few quick tests. Oh and then Apple said it would take a month to replace it with a new one.","7":"The media could not be loaded.\n                \n\n\n\n Bought this laptop bc i needed it for spring semester and i needed an upgrade from my heavy macbook pro. I go to work too so i needed something super light and thin i can just bring everywhere and slide it in my bag.I am obsessed with how fast this macbook is. The battery life is on point. I used it for movies and series at work and it lasted for 3 days. The processor is definitely sooo good. I open so many tabs at once and it has not lagged on me. The keyboard and trackpad is responsive.I love the color. The main reason why i bought this too. 😍😂I have no problems with it at all.Highly recommend","8":"Lightweight, blazing fast, easy to use, battery life is incredible with the new Apple M1 chip.  A typical Great Apple product.However, there is only a Thunderbolt port, so you now have to go out and buy a cable to convert USB to thunderbolt (if you want to use a backup hard drive) or other USB items, AND, I had to buy yet another cable to sync my phone's lightning port to the thunderbolt port on the computer. Total $56.I LOVE Apple product, and worked for them in my caerer, but I would wait on buying this version until the software for it has been developed.UPDATE: After several months of using this computer, I have have found several things of concern:1.  my notification center keeps disappearing, despite my constant reinstalling the widgets.2.  my computer's calendar, reminders, and photo stream do not sync with my IOS devices (iPhone & iPad).  If I add an item to calendar on my phone, it will appear on my mac but not vice versa.  Reminders will not sync regardless of which device I originate the item on.I have contacted Apple support on all these issues and they cannot solve the problem.IT APPEARS THAT THE BUGS HAVE NOT BEEN WORKED OUT, YET.  THINGS ARE MADDENINGLY CLUNKY!","9":"I jumped out of the “Ecosystem” a little while back. Last had a MacBook Pro 13” in about 2015 when we had real ports. I realize those days aren’t coming back and it’s #HubLife or #NoLife. But I’ve been underwhelmed with Apples offerings for a minute.When I started reading up and watching vids on the new M1 I was sold. I’m all in now. This Air is an absolute unit of a machine. I really see no reason for anyone to get the Pro, unless you’re getting the soon to be released updated 16” pro. This bad boy will do all that most people need.Let me say first off, the battery life is phenomenal. I can take it on the go and use it all day with no issues at all. I didn’t even pack my charger with me today. I can carry it in a simple sleeve and I’m good to go. Plus it’s lighter than the pro as well.Performance is spectacular. It runs circles around anything else I have that’s windows based. In testing, I’ve seen it surpass or hold its own, against prior MacBook Pro models. Even those with dedicated graphics.For the majority of people, this is going to be their go to laptop. What you get for an entry level Mac is stellar. This is my recommendation for anyone outside of a hardcore video\/photo editor. But even then, in a pinch it will get the job done.","10":"I'm a software developer and I've only used PC for my entire career. I've been using the windows subsystem for Linux and other Unix based shells for work for a long time and I've always had the desire to try development on a Mac.I assumed that it would be like any other Windows machine that's had the OS replaced with Linux, one of my favorite computers was a Lenovo with Ubuntu on it so that's what I expected.I bought a Surface Pro X which has an ARM based processor (ms sq1 chip) so I thought that I knew what to expect, I assumed that it would be frustrating that the majority of the software I used probably wouldn't work correctly but I have to say that Apple did so much better than Microsoft on this one. The M1 chip makes this $1,000 laptop feel like a $2500 laptop. I've only run into one application that couldn't run and the general online community recommended an alternative for me.the most difficult thing for me was getting used to the different keyboard layout but once I did, this laptop has been nothing short of a pleasure to work with and has replaced my Surface laptop 3 as my daily driver and primary software development machine.I might revert to my Surface laptop three if I go back to .NET development in the future but for the general web stuff I typically do, I couldn't ask for a better machine.The battery life is excellent, this laptop feels premium, I have no doubt that this will last me well into the future and it has completely changed my mind about Apple.The biggest downside in my opinion is that I spent a fortune on accessories and peripherals because Apple products tends to exist in their own separate ecosystem which can be a bit frustrating.One thing that everyone should be aware of is that you can't connect this laptop to two separate external displays. I had to get used to One external display and then using a virtual desktop. That is unfortunate because I really liked having three monitors at all times but I haven't found a way to make it work with this machine.Generally speaking, I would recommend this to anybody who's considering it. Unless you are a PC gamer, there's very little that this computer won't excel at. I'd argue that it might be the best quality laptop in this price range by a factor of two, and I have historically been very critical of Apple.","11":"Opened my brand new $1000++ computer and the entire screen was cracked and destroyed. Awesome! Thanks Amazon.","12":"I'm a Windows guy.  I bought this because I am creating a few apps.  The apps aren't ready; so I really haven't used it yet, beyond exploring for a few hours.  It's neither fast, nor large, by today's standards, but it is solid, light, and robust with Apple's latest release.  It'll last for years.No way to connect Apple's top products:  Mac Air and iPhone.  I guess I need more cables.  Please, sir, take more of my money.","13":"Looked forward to this new MacBook Air.  Loved the Magic Keyboard, but everything else seems half-baked Apple.I didn't know enough to immerse myself in the (hard-to-find)  Essentials Manual before touching the FORCE touchpad.  Took a long time that to realize that \"force\"  really meant FORCE (as in \"smash it down\" )  There is a System Preferences bypass, but I got embroiled in a DARK MODE display (black screen), missing cursor, and of course loss of Intel-chip based favorite apps which all took precedence over trying to find and read a possible Manual.  Help menu did not help..I tried, I really did.  Apple Support suggested and helped for 2 days, with hours spent trying over & over to erase, then Reinstall Big Sur  software, but 2 hours loading (for each of dozens of tries), then \"An error occurred preparing this update.  Please try again.\"was too much, over and over.  This software is not ready for primetime.  Looking forward to AIR's next iteration.Meanwhile, I must be content with my older MacBook Pro, while MacBoo Air is returned:  \"rest in peace\".","14":"I needed a new computer desperately, (screen broke and volume malfunctioned on my beloved old Asus transformer), so after much research about Macs online, I ordered a new MacBook Air. Most of the online reviews and info praised it except for the camera, and in this current pandemic Zoom world, that was a must!  However, I couldn't imagine a new apple  computer having a worse camera than my old iPhone 6 which I am still happily using, so I took a chance! The laptop is awesome on so many levels! New M1 chip, super fast everything, and fantastic color display!The sound and yes, the camera, are phenomenal! I can only assume the bad camera reviews were made by video bloggers that need extreme HD resolution. I just do average work on my computer, so no problem there! I am thoroughly enjoying surfing online, streaming videos, and Zooming with great clarity. I needed to clarify this camera issue for those holding back from purchasing such a great computer just due to those negative camera opinions, as I was. If I had read my review or one similar to it, it would have eased my mind. So, unless you're a vlogger , fear not!It's a fantastic computer in every sense of the word! (Not to mention the $999 price for a new Mac!) Get it!!! You won't regret it! The rose gold is especially pretty!","15":"I purchased for my son to use for school, it stopped working after two weeks, I spent the past two weeks working with Apple who can't get it to function.  I contacted Amazon to replace, they have refused to replace and continue to re-direct me to Apple.  Don't buy an Apple computer from Amazon, they will not replace it even if defective.","16":"I purchased the MacBook Air to replace a 4th Gen Surface Pro that was down to about 30 minutes of battery life.  I purchased an Intel Mac Mini about six months ago and was intrigued by recent news articles regarding the M1 chip.  I'm thrilled with the added battery life on the new device and amazed by the speed difference between my Intel-based mini vs. the M1.  Out of the box, adding a full charge, the new Mac estimates 19+ hours of battery life.  I've been using the computer for three hours, four open apps, and have bumped the battery gauge to 98%.  Think I've eliminated battery anxiety.  App launches are two to three times faster on the Air vs. my Mini.  The new laptop is zippy!  I'm thrilled with my new laptop and look forward to many years together.","17":"This is honestly an excellent machine.Not even interested in discussing \"cons\" because there aren't any if you  weigh up the price point fairly for what is arguably the best ultra portable laptop on the market right now (July 21') and I don't mean the fastest.The \"only two\" thunderbolt slots can be dongled out to the max. If you want a second or third monitor setup, get any \"display-link\" certified hub like the Dell 452-BCYT D6000 Universal Dock (pricey) or the WAVLINK USB 3.0 Universal Laptop Docking Station,USB C to 5K\/ Dual 4K @60Hz Video (cheaper).The 7 cores of GPU on this model won't be noticed vs 8 cores. The machine is a beast. I'm using Lumafusion to process video (not even designed for MacOS but ports across from iPadOS) and it's 3X as fast as the iPad Pro that I own - 2019Best laptop I've ever owned and I've owned two earlier MacBook pro's, a Mac mini, several windows laptops, and the Dell S2721Q 27 Inch 4K UHD monitor I purchased here is parked on top of the last windows machine I purchased.The 4K dell monitor is easily crisp enough for MacOS and I purchased the keyboard used and Magic Mouse (2) new, on Amazon.It's been a while since I've been on MacOS and would describe it as wonderful to use and look at, after coming from windows 10. Sidecar is also amazing (using the iPad Pro to the right for that)If you're shopping for a laptop or a Mac laptop, this is a good option.You'll love it. Nuff said.","18":"I put this along side my £3,500 13” MacBook Pro (2019), which was spec’d up to the max, and the M1 Air wiped the floor with it. Twice as fast encoding the same video, making my top of the line Intel MacBook Pro instantly obsolete. You can not go wrong with this purchase. This is the biggest evolutionary leap in desktop computing since the early 00’s. I’m just upset I bought this as a gift for someone else.","19":"I wanted a new MacBook since it's been several years since I got my last Mac and the battery was going bad.With a delicious gold color and an overall thin, sleek design, this computer is for those who want their computer to look a bit more \"fancy\" than other options on the market.With the M1 chip, everything is extremely fast. I was able to set up this new machine with 10 minutes.I am not sure if I would recommend this machine to those who have recently upgraded to a Mac (2017 to now) but if it's been several years and you want to splurge, go for this.As a writer, the keyboard is so smooth and I feel like I can type more words per minute on this machine.My only complaint is the webcam, while better, is still not up to par to other computer cameras on the market. FaceTime looks a bit grainy still and Photo Booth is just a joke. The quality barely looks different than recent models.Overall, this is a great addition to the Mac family. I look forward to see how Apple utilizes the M1 chip in the future.83\/100","20":"Update:I saw some reviews that said their 3rd party usb hub broke their Mac. I've been using a usb-c to usb-a for a few weeks now with no problems (made by UNI). It's worked for everything I threw at it; Logitech G910 keyboard, Razor mouse, Yamaha digital piano, RME Audio Interface, Roland A-49 midi keyboard. They all worked. I also have a cheapo Amazon Basics single usb adaptor cord about 6\" long, and it too works with everything on the MacBook.After decades of looking through Bill Gates' Windows, I bought my first Mac but only because of the new M1 chip, where everything is on this one chip, which makes it faster. Applications optimized for the M1 now rival high end PCs (and for the first time too). I never was interested in Macs because they were overpriced and underpowered, but it looks like that worm has turned. Just don't buy an earlier version of Macs, especially with Intel chips.Keep in mind when\/if you buy this, there are NO upgrades later on; ZERO, NADA, nothing to change out. You can't add RAM nor Storage once it's built. (There is a workaround on storage, by adding an external SSD drive, but as I understand it there are some problems viewing what is on your external drive, but that may change over time.)Also, SSD storage, while blazingly fast and so worth it, need about 10% 'headroom.' That is for example, if you have 256GB storage, you can only use 230GB as you need a 10% reserve to account for SSDs getting used up. It's the nature of the beast. And of course the preinstalled software also takes up storage space from day one. For my PC I bought a 250GB SSD and found that it was maxing out pretty fast, so I replaced with a 1TB SSD and have already filled up half of it, but I don't expect to fill it up completely anytime soon. It should be good for maybe a decade or so.So bottom line, get at least the 512GB storage or you'll be sorry. It does kind of suck that Apple charges so much for each step increase in storage, but paying the extra $200 in this case is worth it, IMHO. The jury is still out on if you need 16BG of RAM vs the 8GB models currently in stock, (Apple treats it like a custom order at this time, with a waiting period.)  If it was a PC, then getting 16GB RAM is a no-brainer, but in the case of the M1 chip, it shares memory within the chip, making the most use of it. I have 32GB in my PC because RAM sticks are relatively cheap.Remember, once you buy a MacBook, it will stay as is. Upgrades are impossible (which has always been the case for notebooks anyway).","21":"I have had the M1 MacBook Air 13-inch now since December 2020. It has served me so well and has been one of the most reliable laptops I've ever owned. I am originally a PC guy and now work back and forth between Windows OS and Mac OS.When it comes to rendering videos and clips, this does a way better job at 4K resolution compared to my former Alienware 17 inch laptop AND my workplace's gaming desktop!I am pretty happy with the battery life so far. I have been getting 10+ hours of hard real-world usage. I bring a nice USB-C portable battery with me to charge it when I am doing work on the weekends out of town or while on the plane. This thing has not failed me once.8GB of RAM is more than enough for the majority of consumers and is enough for me even though I edit photos and videos all the time. I have not seen any \"throttling\" from the M1 MacBook Air since ownership. I can even open up 30+ tabs on Chrome without issue.256GB storage is enough as long as you have an external storage. I highly recommend investing in getting an SSD or NVMe external storage so transfer speeds are optimal. Otherwise, as long as you are keeping the core hard drive tidy, you won't run into any storage issues.Virtual classes are nice. The webcam quality is crystal clear, and it is noticeably better than most of my peers.My only complaint is that the design is a bit \"outdated\" despite how premium and beautiful it is.Just FYI. I just bought two of these; one for myself and one for my friend who just had a massive upgrade from her \"prehistoric\" 2010 iMac. She was absolutely mindblown by how much faster and better it is compared to the older iMac.Overall, this is a very nice all-around computer laptop for ANY student from K all the way up to the graduate level. Go get this beast of a machine now for $850.","22":"I left the Apple product line years ago due to their practice of \"forced obsolesce\" with early iPhone models. Having worked in IT for most of my career I like being able to have full control of my device. Apple mostly locks up their devices.But, I decided to give the MacBook Air 2020 a chance because: 1. my MS Surface didn't last long enough for the money and it, too, is hardware locked and 2. I was impressed with the M1 specification.After playing with this machine I have to say the M1 is AWESOME! The screen response is shockingly quick in comparison to other PCs and Apple devices.I highly recommend ONLY buying an Apple device WITH a M1 processor.","23":"The computer is everything I thought it would be. Gave the camera a 3 star because quality could be better but I don’t use FaceTime as much so it’s not a big deal to me. Overall so worth the money. Great investment for my book writing and finances.Definitely a major upgrade from my HP.Now I wasn’t sure who to contact about delivery or where to write it but I don’t appreciate having told them I want someone to sign for it being it is a high value priced item and it was just thrown on my porch and I wasn’t notified at all then when I go look it says it was directly handed to me. Don’t like liars so Amazon you need to get it together because if this would have gotten stolen I would have raised hell for my money back.-thanks.","24":"I have used Microsoft Windows based computers 100% since 1985.  Now for the 1st time I decided to try Apple out instead to see how Windows compares to a MacBook.  Only been a few days and I already see things unfamiliar I am learning. So far...I have to say the speed of the new M1 processor compared to any of the Windows 10 computers is very impressive and just the speed and \"faster response\" the MacBook seems to have combined with the programs I have downloaded and a few I purchased I would have to say I prefer the MacBook.  I added a 7 port USB hub and a trackball I use instead of the built in pad but other then that I have not changed a thing.  It definitely does everything I need it to do both business related an for pleasure.  I also enjoy the small portable size and will be taking it on it's first trip in just a few days.  If anyone is a current Windows user and is considering the switch to try out a MacBook I would say go for it and do not look back....If you purchase one and later decide you would prefer not to stick with it a MacBook seems to hold their value much better then the majority of Windows based computers out there.","25":"i am a windows man way back 40 yrs.  since i used windows software for work i saw no reason to switch to apple.  although i did have an apple  IIc for fun way back in the early pc daysMy surface pro entry model has been around for many yrs and the battery has run down and mostly i use it plugged in. I decided to try a mac to learn something new. After research i decided to get the mac air m1 w 8GB ram and the 512GB SSD - this is what i learned ( not going into why i decided what i did as anyone can do the same research1. setup and initial use was not as easy as advertised- couldnt get past the country selection and found after search many had same problem. almost returned it but i finally found i could move selection by tab key AND selection based on space press and  NOT return key - track pad was useless - ( it had a little to do with track pad setup that can only be performed later as well as track pad difference from MS product) .windows and track pad usage not same as windows and i couldn't resize screen windows or even drag them on the screen -plenty of tutorials on you tube - but none really helped decipher selection until i figured it out watching an excel tutorial on how to select and drag cells - you have to \"hard\" press.This hard press finally solved the moving and resizing windows issues - again none of this info was included with product.2. very confusing from reviews n QnAs whether or not this mac had 7 or 8 core GPU - according to internal report its 8 core3. what have i learned -- very lightweight machine- lots of internal tweaking can be done to personalize machine- very fast on the task used - browsing and some excel files now needing to run under mac for which i purchased new software- beautiful screen- great battery life- particularly liked my iphone messages show up on the mac and i can send and receive on same - apple makes computer look sim to phone4. recommendation - for 1000$ to 1200$ a student or any one like me, whos not going to program or have a gazillion windows open or need a large screen, can get this machine - a comparable windows machine would cost same but a windows machine can also be purchased for a lot less and still be capable of student tasks.However, the battery life and weight and integration w iphone tip the scales to this machine if you want to purchase a comparable MS product","26":"Took my chance and bought one used off Amazon warehouse deals. It's brand new except the warranty has only a few months left. Can't complain at all! This computer is awesome as I upgraded from 2013 Macbook Pro Retina. It's way faster. But 8GB of ram will be slow at times, and the laptop gets hot during summer months. Also the trackpad has a tendency of dragging instead of clicking when you're clicking around really fast. Like when you're trying to get that hot concert ticket, and you click really fast on Ticketmaster, it drags the text or link instead of clicking on it like it should which causes a second of two of delay. I hope they get this fixed but it's unlikely they will ever notice this. Most people don't use trackpad to click as fast as me.","27":"I bought this 2020 MacBook Air (8 GB RAM, 256 GB SSD storage) to replace a 2014 MacBook Air (4GB RAM, 256 GB SSD storage).  I am undeniably a fan of Apple products in general, because they work with little fuss and are built to last (note that my old MacBook Air is more than 7 years old and still working perfectly).  Although I've been underwhelmed by some Mac models in recent years, this one is stellar IMHO.  Unless you have very heavy system requirements this machine would be an excellent choice.The M1 processor is very impressive, delivering outstanding performance and power\/thermal efficiency simultaneously.  Battery life is every bit as good as advertised; I can charge overnight and use it all day without plugging in.  Connecting USB devices such as external drives will shorten battery life, but that's to be expected.  I love the fanless design, which means the machine is absolutely silent at all times, while the thermal efficiency of the M1 chip allows it to remain amazingly cool.  In use, this computer feels very fast, especially with apps optimized for Apple processors (as MacOS Big Sur is).  Interestingly, Microsoft has been on board early with M1 optimization; the latest Office 365 version is smooth and fast on this machine.  I also tried out MS Edge on my new laptop based on a recommendation from another user and have been so pleased with its speed and efficiency that it's my current default browser.  The touch ID and Apple Pay capability is a welcome addition.The only cons I see are minor in my opinion.  Because RAM is integrated into the M1 processor, post-purchase memory expansion is not possible; if you think you'll need 16 GB of memory that model can be had from the Apple Store.  There has been criticism of the fact that this machine has only two ports, which is fair.  For me that's not insurmountable; I simply use a USB-C hub to provide additional connectivity.  I've read recently that some users have had certain hubs cause problems with their M1 Macs, which appears to be related to battery charging through these hubs.  To be on the safe side I use a built-in port for charging and have had no issues.Reading through the relative handful of critical reviews, it looks to me like most (excluding actual defects, which happen with all products) are based on lack of understanding.  For example, I saw a large number of reviews complaining that this machine \"has NO USB PORTS!!!\", which is patently false.  In fact, its two ports are both USB, they just require a different connector.  What these users are looking for is the old USB-A connectors, which this MacBook does not have; however, that's easily fixed by using a USB-A to USB-C converter cable, or with a USB-C hub.  USB-A peripherals are gradually disappearing as well, in favor of the new connector.All things considered, I really love this machine.  The $899 price (at the time I bought mine) was $100 less than I would have paid at the Apple Store, and I believe I can probably get $200 on eBay for my old MacBook Air (try that with a 7-year-old PC!) leaving me with a total outlay of $699.  Considering that I'll almost certainly get 5 or more years use out of this model, I'm very happy with my purchase and would do it again.","28":"I've had and used iPhones from the beginning and had iPads since the iPad 2 but this is my very first Mac and I thought it might be a lot to learn this OS but things were familiar cuz I've used and owned iPads and iPhones.  I'm still having to learn a few things and had to Google questions on how to do somethings but it's been a good experience.  I really didn't expect that.  I love the OS BIG SUR and now can't wait to the next OS.  I only got 256gb cuz I didn't know if I would like this plus I knew i had to learn the OS.  Now, I'm waiting for the M2 Mac Book Pro, i plan to invest a lot more money into that one now I know that I like the Apple OS.  Looking at getting 2tb 32gigs of ram!  I like that it runs the apps from iOS or iPadOS!  I wish the screen was better though.  I'm talking at least mini-led but would prefer OLED for what I use it for.  Battery life is amazing! Camera quality sucks.  Come on Apple, give us the 2021 M1 iPad Pro camera and stop being so cheap!I'm happy with my purchase.  I will probably give this to my mom when the M2 MacBook Pro comes out!","29":"Replaced a 10 year old MacBook pro (spinning harddrive, one-hour batter life, spinning beach balls).  Updates are smooth and backing up is seamless.  Able to set it up to limit the tech to just what she needs (right click, what does that do?).  She was very hesitant to get a new computer, as her old one \"works\".  6 months later, she said she wouldn't go back.  Its light with a for-ever battery life.  Thanks, Apple!"}}